# SetLayoutAsMinimumClearSpacing Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarFreeFormAccessor..::..SetLayoutAsMinimumClearSpacing Method
RebarFreeFormAccessor Class See Also
---
Sets the Layout Rule property of rebar set to Minimum Clear Spacing.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public void SetLayoutAsMinimumClearSpacing(
	double spacing
)
```

Visual Basic
---
```text
Public Sub SetLayoutAsMinimumClearSpacing ( _
	spacing As Double _
)
```

Visual C++
---
```text
public:
void SetLayoutAsMinimumClearSpacing(
	double spacing
)
```

# ### Parameters
spacing
    Type: System..::..Double The maximum spacing of bars in set.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This RebarFreeFormAccessor doesn't contain a valid rebar reference. -or- This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID. |

# See Also
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace